Autodesk.Revit.DB.Architecture.StairsType.HasMiddleSupports
True if the stairs type has middle supports, False otherwise.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.MiddleSupportType
The type of middle supports used in the stair.
invalidElementId if the stairs type has no middle support.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: supportType is not a valid middle support type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs type has no middle support so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.MiddleSupportsNumber
The number of middle supports used in the stair.
0 if the stairs type has no middle support.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for supportsNumber is negative.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The stairs type has no middle support so the data being set is not applicable.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RightLateralOffset
The offset for the right support from the edge of the run in a horizontal direction.
0 if the right support is not carriage(open).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The right support style is not carriage(open), so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LeftLateralOffset
The offset for the left support from the edge of the run in a horizontal direction.
0 if the left support is not carriage(open).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for offset must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The left support style is not carriage(open), so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RightSideSupportType
The type of right support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: rightSideStringerTypeId is not a valid support type.
-or-
When setting this property: The specified rightSideStringerTypeId doesn't match the desired style of the right side support.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The right support style is none, so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LeftSideSupportType
The type of left support used in the stair.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: leftSideStringerTypeId is not a valid support type.
-or-
When setting this property: The specified leftSideStringerTypeId doesn't match the desired style of the left side support.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The left support style is none, so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.ConstructionMethod
The construction method of the stairs.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.EndConnectionType
The join style between a run and landing.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.LandingType
The type for all landings in the stair element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified landingTypeId is not a valid landing type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.RunType
The type for all runs in the stair element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The specified runTypeId is not a valid run type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.NotchVerticalGap
The width of the vertical gap in the stairs notch.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for notchVerticalGap must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.NotchHorizontalGap
The width of the horizontal gap in the stairs notch.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for notchHorizontalGap must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.NotchThickness
The vertical length of the notch profile from the top.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for notchThickness must be between 0 and 30000 feet.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.NotchExtension
The horizontal length of the notch profile.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for notchExtension must be no more than 30000 feet in absolute value.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The construction method of the stairs type is not "Precast" or the StairsEndConnectionType of the stairs type is not "Notch", so this related data cannot be set.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.MinRunWidth
The initial value for the width of a common run.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minRunWidth must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.MinTreadDepth
The minimum tread width along the center path for all common runs (winder, arc, and straight).
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for minTreadDepth must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType.MaxRiserHeight
The maximum height of each riser on the stair element.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The given value for maxRiserHeight must be greater than 0 and no more than 30000 feet.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsType
A type element containing the properties for a component-based stair.
Since:
2013